###### 2020-11-10 화요일

# 02_Spark_(2)

##### 스파크에 대한 기본 함수를 사용하여 실습해보았습니다. 



### 목차

#### 1. 스파크 데이터프레임 함수들

#### 2. Titanic 데이셋을 이용한 실습

#### 3. Spark데이터프레임 + SQL구문 사용하기

## 1. 스파크 데이터프레임 함수들

In [4]:
import warnings
warnings.filterwarnings('ignore')

In [5]:
from pyspark import SparkConf, SparkContext
from pyspark.sql import SQLContext

##### 아래 코드는 여러번 실행하면 오류가 뜹니다!

In [23]:
conf = SparkConf().setMaster('local').setAppName('sparkApp')
spark = SparkContext(conf=conf)
spark

ValueError: Cannot run multiple SparkContexts at once; existing SparkContext(app=sparkApp, master=local) created by __init__ at <ipython-input-2-0d4d90c6c2ee>:2

In [8]:
sqlCtx = SQLContext(spark)
sqlCtx

##### 스파크를 이용해 CSV파일을 스파크데이터프레임으로 불러오기

In [31]:
orders = sqlCtx.read.csv('./실습데이터/orders.csv', 
                         header      = True, 
                         inferSchema = True)

In [32]:
orders.printSchema()

root
 |-- OrderID: integer (nullable = true)
 |-- CustomerID: integer (nullable = true)
 |-- EmployeeID: integer (nullable = true)
 |-- OrderDate: string (nullable = true)
 |-- ShipperID: double (nullable = true)

In [33]:
orders.show()

+-------+----------+----------+---------+---------+
|OrderID|CustomerID|EmployeeID|OrderDate|ShipperID|
+-------+----------+----------+---------+---------+
|  10248|        90|         5| 7/4/1996|      3.0|
|  10249|        81|         6| 7/5/1996|      1.0|
|  10250|        34|         4| 7/8/1996|      2.0|
|  10251|        84|         3| 7/8/1996|      1.0|
|  10252|        76|         4| 7/9/1996|      2.0|
|  10253|        34|         3|7/10/1996|      2.0|
|  10254|        14|         5|7/11/1996|      2.0|
|  10255|        68|         9|7/12/1996|      3.0|
|  10256|        88|         3|7/15/1996|      2.0|
|  10257|        35|         4|7/16/1996|      3.0|
|  10258|        20|         1|7/17/1996|      1.0|
|  10259|        13|         4|7/18/1996|      3.0|
|  10260|        55|         4|7/19/1996|      1.0|
|  10261|        61|         4|7/19/1996|      2.0|
|  10262|        65|         8|7/22/1996|      3.0|
|  10263|        20|         9|7/23/1996|      3.0|
|  10264|        24|         6|7/24/1996|      3.0|
|  10265|         7|         2|7/25/1996|      1.0|
|  10266|        87|         3|7/26/1996|      3.0|
|  10267|        25|         4|7/29/1996|      1.0|
+-------+----------+----------+---------+---------+
only showing top 20 rows

In [36]:
print(orders.columns)
print(type(orders))

['OrderID', 'CustomerID', 'EmployeeID', 'OrderDate', 'ShipperID']
<class 'pyspark.sql.dataframe.DataFrame'>

##### 스파크데이터프레임 통계요약 보기

In [37]:
orders.describe().show()

+-------+-----------------+------------------+------------------+---------+------------------+
|summary|          OrderID|        CustomerID|        EmployeeID|OrderDate|         ShipperID|
+-------+-----------------+------------------+------------------+---------+------------------+
|  count|              196|               196|               196|      196|               196|
|   mean|          10345.5| 48.64795918367347|4.3520408163265305|     null|2.0714285714285716|
| stddev|56.72448031200168|25.621776513566466|  2.41651283366105|     null|0.7877263614433762|
|    min|            10248|                 2|                 1| 1/1/1997|               1.0|
|    max|            10443|                91|                 9| 9/9/1996|               3.0|
+-------+-----------------+------------------+------------------+---------+------------------+

In [38]:
orders.summary().show()

+-------+-----------------+------------------+------------------+---------+------------------+
|summary|          OrderID|        CustomerID|        EmployeeID|OrderDate|         ShipperID|
+-------+-----------------+------------------+------------------+---------+------------------+
|  count|              196|               196|               196|      196|               196|
|   mean|          10345.5| 48.64795918367347|4.3520408163265305|     null|2.0714285714285716|
| stddev|56.72448031200168|25.621776513566466|  2.41651283366105|     null|0.7877263614433762|
|    min|            10248|                 2|                 1| 1/1/1997|               1.0|
|    25%|            10296|                25|                 2|     null|               1.0|
|    50%|            10345|                51|                 4|     null|               2.0|
|    75%|            10394|                69|                 6|     null|               3.0|
|    max|            10443|                91|                 9| 9/9/1996|               3.0|
+-------+-----------------+------------------+------------------+---------+------------------+

 - 데이터프래임 첫행 출력하기

In [40]:
orders.first()

Row(OrderID=10248, CustomerID=90, EmployeeID=5, OrderDate='7/4/1996', ShipperID=3.0)

##### 스파크데이터프레임에서 임의의 열을 선택하여  출력해보자

In [41]:
orders.select('OrderID').show()

+-------+
|OrderID|
+-------+
|  10248|
|  10249|
|  10250|
|  10251|
|  10252|
|  10253|
|  10254|
|  10255|
|  10256|
|  10257|
|  10258|
|  10259|
|  10260|
|  10261|
|  10262|
|  10263|
|  10264|
|  10265|
|  10266|
|  10267|
+-------+
only showing top 20 rows

In [44]:
orders.select(['OrderID', 'CustomerID']).show()

+-------+----------+
|OrderID|CustomerID|
+-------+----------+
|  10248|        90|
|  10249|        81|
|  10250|        34|
|  10251|        84|
|  10252|        76|
|  10253|        34|
|  10254|        14|
|  10255|        68|
|  10256|        88|
|  10257|        35|
|  10258|        20|
|  10259|        13|
|  10260|        55|
|  10261|        61|
|  10262|        65|
|  10263|        20|
|  10264|        24|
|  10265|         7|
|  10266|        87|
|  10267|        25|
+-------+----------+
only showing top 20 rows

##### withColumn()
- 스파크데이터프레임에 새로운 칼럼을 추가하거나, 기존에 존재하는 컬름을 업데이터 하는 경우 사용된다

In [48]:
orders.show()

+-------+----------+----------+---------+---------+
|OrderID|CustomerID|EmployeeID|OrderDate|ShipperID|
+-------+----------+----------+---------+---------+
|  10248|        90|         5| 7/4/1996|      3.0|
|  10249|        81|         6| 7/5/1996|      1.0|
|  10250|        34|         4| 7/8/1996|      2.0|
|  10251|        84|         3| 7/8/1996|      1.0|
|  10252|        76|         4| 7/9/1996|      2.0|
|  10253|        34|         3|7/10/1996|      2.0|
|  10254|        14|         5|7/11/1996|      2.0|
|  10255|        68|         9|7/12/1996|      3.0|
|  10256|        88|         3|7/15/1996|      2.0|
|  10257|        35|         4|7/16/1996|      3.0|
|  10258|        20|         1|7/17/1996|      1.0|
|  10259|        13|         4|7/18/1996|      3.0|
|  10260|        55|         4|7/19/1996|      1.0|
|  10261|        61|         4|7/19/1996|      2.0|
|  10262|        65|         8|7/22/1996|      3.0|
|  10263|        20|         9|7/23/1996|      3.0|
|  10264|        24|         6|7/24/1996|      3.0|
|  10265|         7|         2|7/25/1996|      1.0|
|  10266|        87|         3|7/26/1996|      3.0|
|  10267|        25|         4|7/29/1996|      1.0|
+-------+----------+----------+---------+---------+
only showing top 20 rows

In [45]:
orders.withColumn('newOrderID', orders['OrderID']+2).show()

+-------+----------+----------+---------+---------+----------+
|OrderID|CustomerID|EmployeeID|OrderDate|ShipperID|newOrderID|
+-------+----------+----------+---------+---------+----------+
|  10248|        90|         5| 7/4/1996|      3.0|     10250|
|  10249|        81|         6| 7/5/1996|      1.0|     10251|
|  10250|        34|         4| 7/8/1996|      2.0|     10252|
|  10251|        84|         3| 7/8/1996|      1.0|     10253|
|  10252|        76|         4| 7/9/1996|      2.0|     10254|
|  10253|        34|         3|7/10/1996|      2.0|     10255|
|  10254|        14|         5|7/11/1996|      2.0|     10256|
|  10255|        68|         9|7/12/1996|      3.0|     10257|
|  10256|        88|         3|7/15/1996|      2.0|     10258|
|  10257|        35|         4|7/16/1996|      3.0|     10259|
|  10258|        20|         1|7/17/1996|      1.0|     10260|
|  10259|        13|         4|7/18/1996|      3.0|     10261|
|  10260|        55|         4|7/19/1996|      1.0|     10262|
|  10261|        61|         4|7/19/1996|      2.0|     10263|
|  10262|        65|         8|7/22/1996|      3.0|     10264|
|  10263|        20|         9|7/23/1996|      3.0|     10265|
|  10264|        24|         6|7/24/1996|      3.0|     10266|
|  10265|         7|         2|7/25/1996|      1.0|     10267|
|  10266|        87|         3|7/26/1996|      3.0|     10268|
|  10267|        25|         4|7/29/1996|      1.0|     10269|
+-------+----------+----------+---------+---------+----------+
only showing top 20 rows

##### withColumnRenamed()
    - 칼럼의 이름을 수정하는 함수

In [47]:
orders.show()

+-------+----------+----------+---------+---------+
|OrderID|CustomerID|EmployeeID|OrderDate|ShipperID|
+-------+----------+----------+---------+---------+
|  10248|        90|         5| 7/4/1996|      3.0|
|  10249|        81|         6| 7/5/1996|      1.0|
|  10250|        34|         4| 7/8/1996|      2.0|
|  10251|        84|         3| 7/8/1996|      1.0|
|  10252|        76|         4| 7/9/1996|      2.0|
|  10253|        34|         3|7/10/1996|      2.0|
|  10254|        14|         5|7/11/1996|      2.0|
|  10255|        68|         9|7/12/1996|      3.0|
|  10256|        88|         3|7/15/1996|      2.0|
|  10257|        35|         4|7/16/1996|      3.0|
|  10258|        20|         1|7/17/1996|      1.0|
|  10259|        13|         4|7/18/1996|      3.0|
|  10260|        55|         4|7/19/1996|      1.0|
|  10261|        61|         4|7/19/1996|      2.0|
|  10262|        65|         8|7/22/1996|      3.0|
|  10263|        20|         9|7/23/1996|      3.0|
|  10264|        24|         6|7/24/1996|      3.0|
|  10265|         7|         2|7/25/1996|      1.0|
|  10266|        87|         3|7/26/1996|      3.0|
|  10267|        25|         4|7/29/1996|      1.0|
+-------+----------+----------+---------+---------+
only showing top 20 rows

In [46]:
orders.withColumnRenamed('OrderID', 'renameOrderID').show()

+-------------+----------+----------+---------+---------+
|renameOrderID|CustomerID|EmployeeID|OrderDate|ShipperID|
+-------------+----------+----------+---------+---------+
|        10248|        90|         5| 7/4/1996|      3.0|
|        10249|        81|         6| 7/5/1996|      1.0|
|        10250|        34|         4| 7/8/1996|      2.0|
|        10251|        84|         3| 7/8/1996|      1.0|
|        10252|        76|         4| 7/9/1996|      2.0|
|        10253|        34|         3|7/10/1996|      2.0|
|        10254|        14|         5|7/11/1996|      2.0|
|        10255|        68|         9|7/12/1996|      3.0|
|        10256|        88|         3|7/15/1996|      2.0|
|        10257|        35|         4|7/16/1996|      3.0|
|        10258|        20|         1|7/17/1996|      1.0|
|        10259|        13|         4|7/18/1996|      3.0|
|        10260|        55|         4|7/19/1996|      1.0|
|        10261|        61|         4|7/19/1996|      2.0|
|        10262|        65|         8|7/22/1996|      3.0|
|        10263|        20|         9|7/23/1996|      3.0|
|        10264|        24|         6|7/24/1996|      3.0|
|        10265|         7|         2|7/25/1996|      1.0|
|        10266|        87|         3|7/26/1996|      3.0|
|        10267|        25|         4|7/29/1996|      1.0|
+-------------+----------+----------+---------+---------+
only showing top 20 rows

##### groupby()
   - SQL과 pandas에서 했던 groupby와 같은 함수이다!
   - `CustomerID`를 이용해 그룹을지어 개수를 세어보자

In [50]:
orders.groupby('CustomerID').count().show()

+----------+-----+
|CustomerID|count|
+----------+-----+
|        31|    1|
|        85|    2|
|        65|    7|
|        34|    2|
|        81|    2|
|        28|    2|
|        76|    2|
|        27|    1|
|        44|    3|
|        91|    1|
|        47|    1|
|        52|    1|
|        13|    1|
|        86|    4|
|        16|    1|
|         3|    1|
|        20|   10|
|        54|    1|
|        48|    2|
|         5|    3|
+----------+-----+
only showing top 20 rows

In [52]:
cospi = sqlCtx.read.csv('./실습데이터/cospi.csv',
                        header      = True,
                        inferSchema = True)

In [53]:
cospi.printSchema()

root
 |-- Date: string (nullable = true)
 |-- Open: integer (nullable = true)
 |-- High: integer (nullable = true)
 |-- Low: integer (nullable = true)
 |-- Close: integer (nullable = true)
 |-- Volume: integer (nullable = true)

In [54]:
cospi.show()

+----------+-------+-------+-------+-------+------+
|      Date|   Open|   High|    Low|  Close|Volume|
+----------+-------+-------+-------+-------+------+
|2016-02-26|1180000|1187000|1172000|1172000|176906|
|2016-02-25|1172000|1187000|1172000|1179000|128321|
|2016-02-24|1178000|1179000|1161000|1172000|140407|
|2016-02-23|1179000|1189000|1173000|1181000|147578|
|2016-02-22|1190000|1192000|1166000|1175000|174075|
|2016-02-19|1187000|1195000|1174000|1190000|175889|
|2016-02-18|1203000|1203000|1178000|1187000|211795|
|2016-02-17|1179000|1201000|1169000|1185000|245929|
|2016-02-16|1158000|1179000|1157000|1168000|179087|
|2016-02-15|1154000|1160000|1144000|1154000|182471|
|2016-02-12|1130000|1151000|1122000|1130000|254115|
|2016-02-11|1118000|1137000|1118000|1130000|304899|
|2016-02-05|1156000|1169000|1156000|1164000|183280|
|2016-02-04|1150000|1161000|1148000|1156000|236429|
|2016-02-03|1150000|1152000|1137000|1146000|174381|
|2016-02-02|1161000|1166000|1147000|1156000|165420|
|2016-02-01|1152000|1163000|1151000|1163000|258194|
|2016-01-29|1140000|1150000|1116000|1150000|426238|
|2016-01-28|1164000|1168000|1139000|1145000|314154|
|2016-01-27|1126000|1175000|1126000|1175000|273707|
+----------+-------+-------+-------+-------+------+
only showing top 20 rows

##### filter(`조건식`)
   - 조건식에 만족하는 행을 골라내는 함수이다



**날짜가 2월인 데이터만 필터링 한다면?**

In [60]:
cospi.filter(cospi['Date'] >= '2016-02-01').show()

+----------+-------+-------+-------+-------+------+
|      Date|   Open|   High|    Low|  Close|Volume|
+----------+-------+-------+-------+-------+------+
|2016-02-26|1180000|1187000|1172000|1172000|176906|
|2016-02-25|1172000|1187000|1172000|1179000|128321|
|2016-02-24|1178000|1179000|1161000|1172000|140407|
|2016-02-23|1179000|1189000|1173000|1181000|147578|
|2016-02-22|1190000|1192000|1166000|1175000|174075|
|2016-02-19|1187000|1195000|1174000|1190000|175889|
|2016-02-18|1203000|1203000|1178000|1187000|211795|
|2016-02-17|1179000|1201000|1169000|1185000|245929|
|2016-02-16|1158000|1179000|1157000|1168000|179087|
|2016-02-15|1154000|1160000|1144000|1154000|182471|
|2016-02-12|1130000|1151000|1122000|1130000|254115|
|2016-02-11|1118000|1137000|1118000|1130000|304899|
|2016-02-05|1156000|1169000|1156000|1164000|183280|
|2016-02-04|1150000|1161000|1148000|1156000|236429|
|2016-02-03|1150000|1152000|1137000|1146000|174381|
|2016-02-02|1161000|1166000|1147000|1156000|165420|
|2016-02-01|1152000|1163000|1151000|1163000|258194|
+----------+-------+-------+-------+-------+------+

**종가(close)가 1200000이상인 데이터만 필터링 한다면?**

In [66]:
cospi.filter(cospi['Close'] >= 1200000).show()

+----------+-------+-------+-------+-------+------+
|      Date|   Open|   High|    Low|  Close|Volume|
+----------+-------+-------+-------+-------+------+
|2016-01-05|1202000|1218000|1186000|1208000|207947|
|2016-01-04|1260000|1260000|1205000|1205000|304050|
|2015-12-30|1260000|1272000|1254000|1260000|203349|
|2015-12-29|1265000|1266000|1241000|1254000|231802|
|2015-12-28|1285000|1289000|1266000|1266000|225997|
|2015-12-24|1295000|1300000|1285000|1285000|151322|
|2015-12-23|1292000|1299000|1282000|1295000|162043|
|2015-12-22|1280000|1292000|1267000|1292000|203938|
|2015-12-21|1278000|1285000|1261000|1280000|157354|
|2015-12-18|1265000|1288000|1264000|1278000|167721|
|2015-12-17|1301000|1308000|1275000|1290000|167390|
|2015-12-16|1278000|1310000|1278000|1299000|207688|
|2015-12-15|1261000|1280000|1260000|1277000|175253|
|2015-12-14|1273000|1273000|1255000|1261000|222512|
|2015-12-11|1283000|1295000|1272000|1284000|204812|
|2015-12-10|1263000|1293000|1263000|1283000|302978|
|2015-12-09|1262000|1275000|1262000|1263000|181328|
|2015-12-08|1262000|1272000|1262000|1262000|133328|
|2015-12-07|1269000|1275000|1262000|1262000|195237|
|2015-12-04|1275000|1280000|1267000|1269000|189638|
+----------+-------+-------+-------+-------+------+
only showing top 20 rows

##### 종가(Close)가 1200000이상 1250000이하인 경우를 필터링하라

In [68]:
cospi.filter( (cospi['Close'] >= 1200000) & (cospi['Close'] <= 1250000) ).show()

+----------+-------+-------+-------+-------+------+
|      Date|   Open|   High|    Low|  Close|Volume|
+----------+-------+-------+-------+-------+------+
|2016-01-05|1202000|1218000|1186000|1208000|207947|
|2016-01-04|1260000|1260000|1205000|1205000|304050|
|2015-07-30|1258000|1260000|1215000|1215000|307189|
|2015-07-28|1224000|1251000|1219000|1230000|252036|
|2015-07-27|1229000|1247000|1228000|1230000|198204|
|2015-07-24|1227000|1238000|1224000|1229000|194869|
|2015-07-23|1244000|1253000|1234000|1234000|198639|
|2015-07-15|1225000|1238000|1224000|1235000|166863|
|2015-07-14|1265000|1270000|1221000|1225000|367936|
|2015-07-08|1240000|1251000|1232000|1239000|215303|
|2015-07-07|1220000|1259000|1220000|1240000|236882|
|2015-07-06|1253000|1260000|1223000|1230000|195947|
+----------+-------+-------+-------+-------+------+

##### Volume이 300000이하인 경우를 필터링하라

In [69]:
cospi.filter( cospi['Volume'] <= 300000 ).show()

+----------+-------+-------+-------+-------+------+
|      Date|   Open|   High|    Low|  Close|Volume|
+----------+-------+-------+-------+-------+------+
|2016-02-26|1180000|1187000|1172000|1172000|176906|
|2016-02-25|1172000|1187000|1172000|1179000|128321|
|2016-02-24|1178000|1179000|1161000|1172000|140407|
|2016-02-23|1179000|1189000|1173000|1181000|147578|
|2016-02-22|1190000|1192000|1166000|1175000|174075|
|2016-02-19|1187000|1195000|1174000|1190000|175889|
|2016-02-18|1203000|1203000|1178000|1187000|211795|
|2016-02-17|1179000|1201000|1169000|1185000|245929|
|2016-02-16|1158000|1179000|1157000|1168000|179087|
|2016-02-15|1154000|1160000|1144000|1154000|182471|
|2016-02-12|1130000|1151000|1122000|1130000|254115|
|2016-02-05|1156000|1169000|1156000|1164000|183280|
|2016-02-04|1150000|1161000|1148000|1156000|236429|
|2016-02-03|1150000|1152000|1137000|1146000|174381|
|2016-02-02|1161000|1166000|1147000|1156000|165420|
|2016-02-01|1152000|1163000|1151000|1163000|258194|
|2016-01-27|1126000|1175000|1126000|1175000|273707|
|2016-01-26|1155000|1157000|1136000|1137000|151638|
|2016-01-25|1172000|1176000|1156000|1162000|159769|
|2016-01-22|1145000|1168000|1145000|1168000|146591|
+----------+-------+-------+-------+-------+------+
only showing top 20 rows

##### 날짜가 2월 26일인 경우를 필터링하라

In [71]:
cospi.filter( cospi['Date'] == '2016-02-26' ).show()

+----------+-------+-------+-------+-------+------+
|      Date|   Open|   High|    Low|  Close|Volume|
+----------+-------+-------+-------+-------+------+
|2016-02-26|1180000|1187000|1172000|1172000|176906|
+----------+-------+-------+-------+-------+------+

## 2. Titanic 데이셋을 이용한 실습

In [72]:
titanic = sqlCtx.read.csv('./실습데이터/titanic_train.csv',
                          header     = True,
                         inferSchema = True)

In [76]:
titanic.printSchema

<bound method DataFrame.printSchema of DataFrame[PassengerId: int, Survived: int, Pclass: int, Name: string, Sex: string, Age: double, SibSp: int, Parch: int, Ticket: string, Fare: double, Cabin: string, Embarked: string]>

In [73]:
titanic.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [75]:
titanic.columns

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [79]:
titanic.count()

891

##### titanic 스파크 데이터프레임에서 PassengerId와 Name 칼럼을 선택하라

In [82]:
titanic.select(['PassengerId', 'Name']).show()

+-----------+--------------------+
|PassengerId|                Name|
+-----------+--------------------+
|          1|Braund, Mr. Owen ...|
|          2|Cumings, Mrs. Joh...|
|          3|Heikkinen, Miss. ...|
|          4|Futrelle, Mrs. Ja...|
|          5|Allen, Mr. Willia...|
|          6|    Moran, Mr. James|
|          7|McCarthy, Mr. Tim...|
|          8|Palsson, Master. ...|
|          9|Johnson, Mrs. Osc...|
|         10|Nasser, Mrs. Nich...|
|         11|Sandstrom, Miss. ...|
|         12|Bonnell, Miss. El...|
|         13|Saundercock, Mr. ...|
|         14|Andersson, Mr. An...|
|         15|Vestrom, Miss. Hu...|
|         16|Hewlett, Mrs. (Ma...|
|         17|Rice, Master. Eugene|
|         18|Williams, Mr. Cha...|
|         19|Vander Planke, Mr...|
|         20|Masselmani, Mrs. ...|
+-----------+--------------------+
only showing top 20 rows

##### 성별이 여성인 PassengerId, Name, Sex, Survived 칼럼만 선택하여 출력하라

In [84]:
titanic.filter(titanic['Sex'] == 'female').select(['PassengerId', 'Name', 'Sex', 'Survived']).show()

+-----------+--------------------+------+--------+
|PassengerId|                Name|   Sex|Survived|
+-----------+--------------------+------+--------+
|          2|Cumings, Mrs. Joh...|female|       1|
|          3|Heikkinen, Miss. ...|female|       1|
|          4|Futrelle, Mrs. Ja...|female|       1|
|          9|Johnson, Mrs. Osc...|female|       1|
|         10|Nasser, Mrs. Nich...|female|       1|
|         11|Sandstrom, Miss. ...|female|       1|
|         12|Bonnell, Miss. El...|female|       1|
|         15|Vestrom, Miss. Hu...|female|       0|
|         16|Hewlett, Mrs. (Ma...|female|       1|
|         19|Vander Planke, Mr...|female|       0|
|         20|Masselmani, Mrs. ...|female|       1|
|         23|"McGowan, Miss. A...|female|       1|
|         25|Palsson, Miss. To...|female|       0|
|         26|Asplund, Mrs. Car...|female|       1|
|         29|"O'Dwyer, Miss. E...|female|       1|
|         32|Spencer, Mrs. Wil...|female|       1|
|         33|Glynn, Miss. Mary...|female|       1|
|         39|Vander Planke, Mi...|female|       0|
|         40|Nicola-Yarred, Mi...|female|       1|
|         41|Ahlin, Mrs. Johan...|female|       0|
+-----------+--------------------+------+--------+
only showing top 20 rows

##### 여성 중에서 살아있는 사람의 행만 출력해보라

In [88]:
titanic.filter( (titanic['Sex'] == 'female') & (titanic['Survived'] == 1) ).show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+--------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|    Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+--------+-----+--------+
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599| 71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|   7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|    53.1| C123|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742| 11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736| 30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|    16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|   26.55| C103|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|    16.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|   7.225| null|       C|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|          330923|  8.0292| null|       Q|
|         26|       1|     3|Asplund, Mrs. Car...|female|38.0|    1|    5|          347077| 31.3875| null|       S|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|          330959|  7.8792| null|       Q|
|         32|       1|     1|Spencer, Mrs. Wil...|female|null|    1|    0|        PC 17569|146.5208|  B78|       C|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|          335677|    7.75| null|       Q|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|            2651| 11.2417| null|       C|
|         44|       1|     2|Laroche, Miss. Si...|female| 3.0|    1|    2|   SC/Paris 2123| 41.5792| null|       C|
|         45|       1|     3|Devaney, Miss. Ma...|female|19.0|    0|    0|          330958|  7.8792| null|       Q|
|         48|       1|     3|O'Driscoll, Miss....|female|null|    0|    0|           14311|    7.75| null|       Q|
|         53|       1|     1|Harper, Mrs. Henr...|female|49.0|    1|    0|        PC 17572| 76.7292|  D33|       C|
|         54|       1|     2|Faunthorpe, Mrs. ...|female|29.0|    1|    0|            2926|    26.0| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+--------+-----+--------+
only showing top 20 rows

##### 선실등급(Pclass) 별  요금평균을 확인한다면?

In [96]:
titanic.groupby('Pclass').agg({'Fare' : 'mean'}).show()

+------+------------------+
|Pclass|         avg(Fare)|
+------+------------------+
|     1| 84.15468749999992|
|     3|13.675550101832997|
|     2| 20.66218315217391|
+------+------------------+

In [99]:
titanic[['Pclass', 'Fare']].groupby('Pclass').mean().show()

+------+-----------+------------------+
|Pclass|avg(Pclass)|         avg(Fare)|
+------+-----------+------------------+
|     1|        1.0| 84.15468749999992|
|     3|        3.0|13.675550101832997|
|     2|        2.0| 20.66218315217391|
+------+-----------+------------------+

In [100]:
titanic.select(['Pclass', 'Fare']).groupby('Pclass').mean().show()

+------+-----------+------------------+
|Pclass|avg(Pclass)|         avg(Fare)|
+------+-----------+------------------+
|     1|        1.0| 84.15468749999992|
|     3|        3.0|13.675550101832997|
|     2|        2.0| 20.66218315217391|
+------+-----------+------------------+

In [101]:
titanic.createOrReplaceTempView('titanicView')

## 3. Spark데이터프레임 + SQL구문 사용하기

In [102]:
import pandas as pd

In [103]:
data1 = {'PassengerId':{0:1, 1:2, 2:3, 3:4, 4:5},
         'Name' : {0:'Owen', 1:'Florence', 2:'Laina', 3:'Lily', 4:"William"},
         'sex' : {0: 'male', 1: 'female', 2:'female', 3:'female', 4:'male'},
         'Survived': {0:0, 1:1, 2:1, 3:1, 4:0}
        }

data2 = {'PassengerId':{0:1, 1:2, 2:3, 3:4, 4:5},
         'Age' : {0: 22, 1: 38, 2: 33, 3: 35, 4: 35},
         'Fare' : {0: 7.3, 1: 71.3, 2:7.9, 3:53.1, 4:8.0},
         'Pclass': {0:3, 1:1, 2:3, 3:1, 4:3}
        }

In [104]:
data1.keys()

dict_keys(['PassengerId', 'Name', 'sex', 'Survived'])

In [106]:
sample_df01 = pd.DataFrame(data1)
sample_df02 = pd.DataFrame(data2)

In [107]:
display(sample_df01)
display(sample_df02)

   PassengerId      Name     sex  Survived
0            1      Owen    male         0
1            2  Florence  female         1
2            3     Laina  female         1
3            4      Lily  female         1
4            5   William    male         0

   PassengerId  Age  Fare  Pclass
0            1   22   7.3       3
1            2   38  71.3       1
2            3   33   7.9       3
3            4   35  53.1       1
4            5   35   8.0       3

In [108]:
spark_df01 = sqlCtx.createDataFrame(sample_df01)
spark_df02 = sqlCtx.createDataFrame(sample_df02)

In [111]:
print(type(sample_df01))
print(type(spark_df01))
print(type(sample_df02))
print(type(spark_df02))

<class 'pandas.core.frame.DataFrame'>
<class 'pyspark.sql.dataframe.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pyspark.sql.dataframe.DataFrame'>

In [112]:
spark_df01.createOrReplaceTempView('titanic01')
spark_df02.createOrReplaceTempView('titanic02')

##### Spark SQL SELECT

In [117]:
sqlCtx.sql('select * from titanic01').show()

+-----------+--------+------+--------+
|PassengerId|    Name|   sex|Survived|
+-----------+--------+------+--------+
|          1|    Owen|  male|       0|
|          2|Florence|female|       1|
|          3|   Laina|female|       1|
|          4|    Lily|female|       1|
|          5| William|  male|       0|
+-----------+--------+------+--------+

##### sql 구문을 이용하여 성별에 따른 승객 수를 구해본다면?

In [130]:
sql = """
    SELECT      sex, COUNT(Survived) AS cnt
    FROM        titanic01
    GROUP BY    sex
"""

sqlCtx.sql(sql).show()

+------+---+
|   sex|cnt|
+------+---+
|female|  3|
|  male|  2|
+------+---+

##### sql구문을 이용하여 `titanic01`테이블과 `titanic02`테이블을 `PassengerId`를 기준으로 조인하고
##### 선실등급(Pclass)과 성별(sex)에 따른 요금의 평균을 구하여라

In [138]:
join = """
    SELECT       Pclass, sex, AVG(Fare)
    FROM         titanic01
    LEFT JOIN    titanic02   USING(PassengerId)
    GROUP BY     Pclass, sex
"""


sqlCtx.sql(join).show()

+------+------+---------+
|Pclass|   sex|avg(Fare)|
+------+------+---------+
|     3|female|      7.9|
|     3|  male|     7.65|
|     1|female|     62.2|
+------+------+---------+